[
  {
    "bodyPart": "waist",
    "equipment": "body weight",
    "id": "0001",
    "name": "3/4 sit-up",
    "target": "abs",
    "secondaryMuscles": [
      "hip flexors",
      "lower back"
    ],
    "instructions": [
      "Lie flat on your back with your knees bent and feet flat on the ground.",
      "Place your hands behind your head with your elbows pointing outwards.",
      "Engaging your abs, slowly lift your upper body off the ground, curling forward until your torso is at a 45-degree angle.",
      "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The 3/4 sit-up is an abdominal exercise performed with body weight. It involves curling the torso up to a 45-degree angle, engaging the abs, hip flexors, and lower back. This movement is commonly used to build core strength and stability.",
    "difficulty": "beginner",
    "category": "strength"
  },
  {
    "bodyPart": "waist",
    "equipment": "body weight",
    "id": "0002",
    "name": "45° side bend",
    "target": "abs",
    "secondaryMuscles": [
      "obliques"
    ],
    "instructions": [
      "Stand with your feet shoulder-width apart and your arms extended straight down by your sides.",
      "Keeping your back straight and your core engaged, slowly bend your torso to one side, lowering your hand towards your knee.",
      "Pause for a moment at the bottom, then slowly return to the starting position.",
      "Repeat on the other side.",
      "Continue alternating sides for the desired number of repetitions."
    ],
    "description": "The 45° side bend is a bodyweight exercise targeting the abdominal muscles, particularly the obliques. It involves bending the torso to the side while standing, engaging the core for stability and control.",
    "difficulty": "beginner",
    "category": "strength"
  },
  {
    "bodyPart": "waist",
    "equipment": "body weight",
    "id": "0003",
    "name": "air bike",
    "target": "abs",
    "secondaryMuscles": [
      "hip flexors"
    ],
    "instructions": [
      "Lie flat on your back with your hands placed behind your head.",
      "Lift your legs off the ground and bend your knees at a 90-degree angle.",
      "Bring your right elbow towards your left knee while simultaneously straightening your right leg.",
      "Return to the starting position and repeat the movement on the opposite side, bringing your left elbow towards your right knee while straightening your left leg.",
      "Continue alternating sides in a pedaling motion for the desired number of repetitions."
    ],
    "description": "The air bike is a bodyweight exercise targeting the abdominal muscles and hip flexors. It involves a pedaling motion while lying on your back, alternating elbow-to-knee contact to engage the core.",
    "difficulty": "beginner",
    "category": "strength"
  },
  {
    "bodyPart": "waist",
    "equipment": "body weight",
    "id": "0006",
    "name": "alternate heel touchers",
    "target": "abs",
    "secondaryMuscles": [
      "obliques"
    ],
    "instructions": [
      "Lie flat on your back with your knees bent and feet flat on the ground.",
      "Extend your arms straight out to the sides, parallel to the ground.",
      "Engaging your abs, lift your shoulders off the ground and reach your right hand towards your right heel.",
      "Return to the starting position and repeat on the left side, reaching your left hand towards your left heel.",
      "Continue alternating sides for the desired number of repetitions."
    ],
    "description": "Alternate heel touchers is a bodyweight exercise targeting the abdominal muscles, particularly the obliques. It involves lying on your back, lifting your shoulders, and reaching side to side to touch your heels, engaging your core throughout.",
    "difficulty": "beginner",
    "category": "strength"
  },
  {
    "bodyPart": "upper legs",
    "equipment": "body weight",
    "id": "0020",
    "name": "balance board",
    "target": "quads",
    "secondaryMuscles": [
      "calves",
      "hamstrings",
      "glutes"
    ],
    "instructions": [
      "Place the balance board on a flat surface.",
      "Step onto the balance board with one foot, ensuring it is centered.",
      "Slowly shift your weight onto the foot on the balance board, keeping your core engaged.",
      "Maintain your balance and stability as you hold the position for a desired amount of time.",
      "Repeat the exercise with the other foot."
    ],
    "description": "The balance board exercise involves standing on a balance board with one foot, engaging the core and lower body muscles to maintain stability and balance. This exercise primarily targets the quads, while also engaging the calves, hamstrings, and glutes as secondary muscles.",
    "difficulty": "intermediate",
    "category": "balance"
  },
  {
    "bodyPart": "upper arms",
    "equipment": "body weight",
    "id": "0129",
    "name": "bench dip (knees bent)",
    "target": "triceps",
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Sit on the edge of a bench or chair with your hands gripping the edge next to your hips.",
      "Slide your butt off the bench and straighten your legs in front of you, keeping your heels on the ground.",
      "Bend your elbows and lower your body towards the ground, keeping your back close to the bench.",
      "Pause for a moment at the bottom, then push yourself back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The bench dip (knees bent) is a bodyweight exercise that primarily targets the triceps, with secondary emphasis on the chest and shoulders. It is performed using a bench or chair and is suitable for building upper arm strength.",
    "difficulty": "beginner",
    "category": "strength"
  },
  {
    "bodyPart": "upper legs",
    "equipment": "body weight",
    "id": "0130",
    "name": "bench hip extension",
    "target": "glutes",
    "secondaryMuscles": [
      "hamstrings"
    ],
    "instructions": [
      "Sit on a bench with your back against the bench and your feet flat on the ground.",
      "Place your hands on the bench for support.",
      "Engage your glutes and hamstrings, then lift your hips off the bench until your body forms a straight line from your knees to your shoulders.",
      "Pause for a moment at the top, then slowly lower your hips back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The bench hip extension is a bodyweight exercise targeting the glutes and hamstrings. It involves lifting the hips off a bench to form a straight line from knees to shoulders, emphasizing glute activation and hip extension strength.",
    "difficulty": "beginner",
    "category": "strength"
  },
  {
    "bodyPart": "upper arms",
    "equipment": "body weight",
    "id": "0137",
    "name": "body-up",
    "target": "triceps",
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Start by placing your hands on a raised surface, such as a bench or parallel bars, with your palms facing down and fingers pointing forward.",
      "Extend your legs out in front of you, keeping your heels on the ground and your body straight.",
      "Lower your body by bending your elbows, keeping them close to your sides, until your upper arms are parallel to the ground.",
      "Pause for a moment, then push through your palms to straighten your arms and lift your body back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The body-up is a bodyweight exercise targeting the triceps, with secondary emphasis on the chest and shoulders. It involves lowering and raising your body using your arms while keeping your body straight, similar to a triceps dip but with feet on the ground.",
    "difficulty": "beginner",
    "category": "strength"
  },
  {
    "bodyPart": "waist",
    "equipment": "body weight",
    "id": "0138",
    "name": "bottoms-up",
    "target": "abs",
    "secondaryMuscles": [
      "obliques",
      "hip flexors"
    ],
    "instructions": [
      "Lie flat on your back with your legs extended and your arms by your sides.",
      "Bend your knees and bring them towards your chest, keeping your feet off the ground.",
      "Engaging your abs, lift your hips off the ground, bringing your knees towards your head.",
      "Pause for a moment at the top, then slowly lower your hips back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "The bottoms-up exercise is a bodyweight movement targeting the abdominal muscles. It involves lying on your back, bringing your knees toward your chest, and lifting your hips off the ground to engage your core.",
    "difficulty": "intermediate",
    "category": "strength"
  },
  {
    "bodyPart": "upper arms",
    "equipment": "body weight",
    "id": "0139",
    "name": "biceps narrow pull-ups",
    "target": "biceps",
    "secondaryMuscles": [
      "forearms",
      "shoulders"
    ],
    "instructions": [
      "Hang from a pull-up bar with your palms facing towards you and your hands shoulder-width apart.",
      "Engage your core and pull yourself up towards the bar, focusing on using your biceps to lift your body.",
      "Pause for a moment at the top, then slowly lower yourself back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "description": "Biceps narrow pull-ups are a bodyweight exercise that primarily targets the biceps, with secondary emphasis on the forearms and shoulders. The movement involves pulling your body up to a bar with a narrow, underhand grip, requiring significant upper body strength and coordination.",
    "difficulty": "advanced",
    "category": "strength"
  }
]